# -*- coding: utf-8 -*-
"""
Created on Thu Jan 24 14:16:18 2019

@author: Ahmed Ali
"""

import numpy as np

mx1=np.arange(1,10)

mx1=np.reshape(mx1,(3,3))
# طريقة اخرى لتهيئة المصفوفة تشايه reshape
mx2=np.matrix('{} {} ; {} {}'.format(1,2,3,4));
#بيجمع مجموع العناصر اللى ف الديجونل ويخزنهم  ف ال su
su=np.trace(mx2)

#العمليات الرياضيه عل المصفوفات 

a=np.random.randint(1,20,size=9).reshape(3,3)
b=np.random.randint(1,20,size=9).reshape(3,3)

c=a+b #  لازم يكون الحجم متساوى مثل 2*2 و 2*2


d=a+4 #بتجمع عل جميع العناصر 4

e=a-5 #طرح 5 من جميع العناصر

f=a*3# ضرب *3

g=a/2 #قسمه /2


h=a%3  # 


#جمع جميع العناصر ف المصفوفه
#______________________
su=np.sum(a)   #جمع جميع العناصر
print(su) 
 #_______________
 su=np.sum(a,axis=1) #جمع الصفوف
 #____________________________
 su=np.sum(a,axis=0)#جمع الصفوف
 #_______________________

 
 
aa=np.random.randint(1,20,size=12).reshape(4,3)
bb=np.random.randint(1,20,size=15).reshape(3,5)
#___________________________________________________
#___________________________________________________
#    مهمه جدا ضرب مصفوفتين بناء عل قانون الصف يساوى العمود 
cd=np.dot(aa,bb)
#___________________________________________________
#___________________________________________________

# الترتيب sort
print(aa)
np.sort(aa,axis=0)#بيرتب العواميد
np.sort(aa,axis=1)#بيرتب الصفوف

#____________________________________________________

print(np.linalg.inv(e)) # لاحظ انالمتركس لازم تكون مربعه


