# -*- coding: utf-8 -*-
"""
Created on Sun Jan 27 09:48:25 2019

@author: Ahmed Ali
"""

import pandas as pd

#                      الرسوم البيانيه      

data=pd.Series([1,4,5,7,9,10,6.3,3.7])
#___________________________________________________________________
data.plot()# بترسم بناع عن الكى ف ال xوالفاليوا ف ال y
#__________________________________________________________________
data.plot(kind='line')  #قولتله ان نوع الرسمه خطى هيا اصلا ديفولت 
#_______________________________________________________________
data.plot('pie') #بقوله ان نوع الرسم الدايره دى 

#رسم الدايره بيوزع ب الانديكس يعنى ف الانديكس 0 موجود 1 واحد اصغر قيمه
# ف تلاقى جزئة صغير وهتلاقى اكبر جزء عند ال 5 ف الرسمه اللى هيا 10
# ف السريس وهذا 
#_________________________________________________________________

data.plot('bar') #بيرسمها ك عواميد زى ما انت شايف 
#فكرته نفس فكرة الدايرة القيمه الكبيره تاخد عمود عالى 
#_________________________________________________________________

data.plot('barh') 
#نفس حوار البار اللى فوق بس فيه حرف اتش معناها هورزنتل افقى 
#____________________________________________________________________
data.plot('hist') #الهيستوجرام 
#متعلق ب عدد مرات تكرار الرقم او الداتا اللى ف السيريس
#____________________________________________________________________
data.plot('box') #بيبدأ عن اصغر رقم واخره عندالاكبر والميدين ف النصف
#___________________________________________________________________
data.plot('kde')#متععلقه ب الكثافه او التكرار 
# kde==density
data.plot('density')
#____________________________________________________________________
data.plot('area') #برضوا بتتعلق ب التكرار والكثافه 

